# Create a Table
## The project details:
In this project, you will create your own friends table and add/delete data from it!

In [ ]:
-- 1 Create a table named friends with three columns:
-- id that stores INTEGER
-- name that stores TEXT
-- birthday that stores DATE

CREATE TABLE friends (
  id INTEGER,
  name TEXT,
  birthday DATE
);

-- Results

Query Results
Database Schema
celebs
name	type
id	INTEGER
name	TEXT
age	INTEGER
Rows: 1
contacts
name	type
id	INTEGER
name	TEXT
birthday	DATE
Rows: 4
friends
name	type
id	INTEGER
name	TEXT
birthday	DATE
Rows: 0

In [ ]:
-- 2 Add Ororo Munroe to friends.
-- Her birthday is May 30th, 1940.

INSERT INTO friends (id, name, birthday) 
VALUES (1, 'Ororo Munroe', '1940-05-30');

-- Results

friends
name	type
id	INTEGER
name	TEXT
birthday	DATE
Rows: 1

In [ ]:
-- 3 Let’s make sure that Ororo has been added to the database:

SELECT * FROM friends;

-- Results

Query Results
id	name	birthday
1	Ororo Munroe	1940-05-30

In [ ]:
-- 4 Add two of your friends to the table.
-- Insert an id, name, and birthday for each of them.

INSERT INTO friends (id, name, birthday) 
VALUES (2, 'BFF One', 'YYYY-MM-DD');

INSERT INTO friends (id, name, birthday) 
VALUES (3, 'BFF Two', 'YYYY-MM-DD');

-- Results

Query Results
id	name	birthday
1	Ororo Munroe	1940-05-30
2	BFF One	YYYY-MM-DD
3	BFF Two	YYYY-MM-DD

In [ ]:
-- 5 Ororo Munroe just realized that she can control the weather and 
-- decided to change her name. Her new name is “Storm”.
-- Update her record in friends.

UPDATE friends
SET name = 'Storm'
WHERE name = 'Ororo Munroe';

-- Result

id	name	birthday
1	Storm	1940-05-30

In [ ]:
-- 6 Add a new column named email.

ALTER TABLE friends
ADD COLUMN email TEXT;

-- Results

Query Results
id	name	birthday	email
1	Storm	1940-05-30	
2	BFF One	YYYY-MM-DD	
3	BFF Two	YYYY-MM-DD

In [ ]:
-- 7 Update the email address for everyone in your table.
-- Storm’s email is storm@codecademy.com.

UPDATE friends SET email = 'storm@codecademy.com' WHERE name = 'Storm';

-- Result

id	name	birthday	email
1	Storm	1940-05-30	storm@codecademy.com
2	BFF One	YYYY-MM-DD

In [ ]:
-- 8 Wait, Storm is fictional…
-- Remove her from friends.

DELETE FROM friends WHERE id = 1;

-- Results

Query Results
id	name	birthday	email
2	BFF One	YYYY-MM-DD	
3	BFF Two	YYYY-MM-DD

## Review
Using some of the sql common commands to create a new table, editing it, and deleting items.